LEXICON_RU: dict[str, str] = {
    'start_help': 'Привет!👋\n\n'
                  'Если ты нашел этот бот, то, наверное, у тебя уже есть логин и пароль. '
                  'Чтобы войти нажми /login\n\n'
                  'Но если ты случайно оказался здесь, я могу отправить тебе картинку с котиками '
                  '(даже не одну)🐱 '
                  'Для этого нажми /cat',

    'no_cat': 'Котика нет😿',

    'ask_login': 'Пожалуйста, отправь мне свой логин',

    'not_login': 'То, что ты отправил не похоже на логин🤔\n'
                 'Пожалуйста, введи корректный логин!\n\n'
                 'Если хочешь прервать авторизацию - отправь команду /cancel',

    'good_login': 'Спасибо!\n\nА теперь введи пароль',

    'bad_login': 'Кажется, ты ввел неверный логин\n\n'
                 'Пожалуйста, попробуй еще раз или напиши админу, что все сломалось🤯\n\n'
                 'Если хочешь прервать авторизацию - отправь команду /cancel',

    'not_password': 'То, что ты отправил не похоже на пароль🤔\n'
                    'Пожалуйста, введи корректный пароль!\n\n'
                    'Если хочешь прервать авторизацию - отправь команду /cancel',

    'good_password': 'Спасибо!\n\n'
                     'Теперь ты авторизован и можешь получить свое поздравление🎉💜',

    'bad_password': 'Кажется, ты ввел неверный пароль\n\n'
                    'Пожалуйста, попробуй еще раз или напиши админу, что все сломалось🤯\n\n'
                    'Если хочешь прервать авторизацию - отправь команду /cancel',

    'already_logged_in': 'Я вижу, что ты уже авторизовался!\n\n'
                         'Меня не обмануть😄',

    'cancel': 'Ты прервал авторизацию😢\n\n'
              'Чтобы снова вернуться к ней - '
              'отправьте команду /login',

    'hard_year': 'Здесь должен быть вступительный текст',

    'start_game': 'И чтобы ты не скучал, предлагаю сыграть в небольшую игру. Ты согласен?',

    'rules': 'В игре есть 9 лотерейных билетов: выигрышные и нет. '
             'Ты можешь выбрать только 3 номера. Желаю удачи!',

    'yes_button': 'Выбери первую цифру',

    'no_button': 'Ответ неверный. Попробуй еще раз!',

    'not_a_gift': 'Пожалуйста, пользуйся кнопками при выборе номера лотерейного билета',

    'chosen_gift': 'Ты выбрал подарок',

    'second_gift': 'Выбери вторую цифру',

    'third_gift': 'Выбери последнюю цифру',

    'cats': 'И чтобы еще немного поднять тебе настроение, '
            'предлагаю посмотреть фотографии рыжих котиков🐈 (все же их любят, верно?)\n\n'
            'Сколько котиков тебе отправить?',

    'congratulations': 'Здесь должны быть пожелания',

    'finish': 'На этом все. С Днем рождения!'
}
